"Operation succeeded"  = "Operação bem-sucedida";
"ID is invalid"  = "ID inválido";
"Write attempted on stale version of object"  = "Tentativa de escrita em versão desactualizada do objecto";
"No space available for write operation"  = "Não existe espaço disponível para escrita";
"Permission denied"  = "Permissão negada";
"No such directory"  = "Directório inexistente";
"No such property"  = "Propriedade inexistente";
"No such name"  = "Nome inexistente";
"Cannot delete name object with children"  = "Impossível apagar objecto nome com ligação descendente";
"Object is not child of parent: cannot destroy"  = "Objecto sem ligação ascendente ou descendente: impossível destruir";
"Serialization error"  = "Erro de serialização";
"Hit network root domain"  = "Aceder a domínio superior da rede";
"No response from remote parent"  = "Sem resposta remota";
"No writes allowed: all objects are read-only"  = "Escrita não permitida: todos os objectos são apenas para leitura";
"Remote system error" = "Erro de sistema remoto";
"Can't regenerate: already in use"  = "Impossível renovar: já em utilização";
"Operation makes no sense on clone"  = "Operação sem sentido em clone";
"Can't find address of server"  = "O endereço do servidor não foi localizado";
"Duplicate domain tag: can't serve it"  = "Duplicação de identificador de domínio: impossível aceder";
"No such tag"  = "Identificador inexistente";
"Authentication error" = "Erro de autenticação";
"No such user" = "Utilizador inexistente";
"Master server is busy" = "O servidor principal está ocupado";
"Invalid domain" = "Domínio inválido";
"Invalid operation on master" = "Operação inválida no servidor principal";
"Communication failure" = "Falha de comunicação";
"(unknown error)" = "(erro desconhecido)";
